jminor717/Teensy-Coil-Gun/V3/PIC18F45_CoilGunController.X/mcc_generated_files/pin_manager.h
  @Param
    InterruptHandler function pointer.

  @Example
    PIN_MANAGER_Initialize();
    IOCEF0_SetInterruptHandler(MyInterruptHandler);

*/
void IOCEF0_SetInterruptHandler(void (* InterruptHandler)(void));

/**
  @Summary
    Dynamic Interrupt Handler for IOCEF0 pin

  @Description
    This is a dynamic interrupt handler to be used together with the IOCEF0_SetInterruptHandler() method.
    This handler is called every time the IOCEF0 ISR is executed and allows any function to be registered at runtime.
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    None.

  @Example
    PIN_MANAGER_Initialize();
    IOCEF0_SetInterruptHandler(IOCEF0_InterruptHandler);

*/
extern void (*IOCEF0_InterruptHandler)(void);

/**
  @Summary
    Default Interrupt Handler for IOCEF0 pin

  @Description
    This is a predefined interrupt handler to be used together with the IOCEF0_SetInterruptHandler() method.
    This handler is called every time the IOCEF0 ISR is executed. 
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    None.

  @Example
    PIN_MANAGER_Initialize();
    IOCEF0_SetInterruptHandler(IOCEF0_DefaultInterruptHandler);

*/
void IOCEF0_DefaultInterruptHandler(void);


/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handler for the IOCEF1 pin functionality
 * @Example
    IOCEF1_ISR();
 */
void IOCEF1_ISR(void);

/**
  @Summary
    Interrupt Handler Setter for IOCEF1 pin interrupt-on-change functionality

  @Description
    Allows selecting an interrupt handler for IOCEF1 at application runtime
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    InterruptHandler function pointer.

  @Example
    PIN_MANAGER_Initialize();
    IOCEF1_SetInterruptHandler(MyInterruptHandler);

*/
void IOCEF1_SetInterruptHandler(void (* InterruptHandler)(void));

/**
  @Summary
    Dynamic Interrupt Handler for IOCEF1 pin

  @Description
    This is a dynamic interrupt handler to be used together with the IOCEF1_SetInterruptHandler() method.
    This handler is called every time the IOCEF1 ISR is executed and allows any function to be registered at runtime.
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    None.

  @Example
    PIN_MANAGER_Initialize();
    IOCEF1_SetInterruptHandler(IOCEF1_InterruptHandler);

*/
extern void (*IOCEF1_InterruptHandler)(void);

/**
  @Summary
    Default Interrupt Handler for IOCEF1 pin

  @Description
    This is a predefined interrupt handler to be used together with the IOCEF1_SetInterruptHandler() method.
    This handler is called every time the IOCEF1 ISR is executed. 
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    None.

  @Example
    PIN_MANAGER_Initialize();
    IOCEF1_SetInterruptHandler(IOCEF1_DefaultInterruptHandler);

*/
void IOCEF1_DefaultInterruptHandler(void);


/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handler for the IOCEF2 pin functionality
 * @Example
    IOCEF2_ISR();
 */
void IOCEF2_ISR(void);

/**
  @Summary
    Interrupt Handler Setter for IOCEF2 pin interrupt-on-change functionality

  @Description
    Allows selecting an interrupt handler for IOCEF2 at application runtime
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    InterruptHandler function pointer.

  @Example
    PIN_MANAGER_Initialize();
    IOCEF2_SetInterruptHandler(MyInterruptHandler);

*/
void IOCEF2_SetInterruptHandler(void (* InterruptHandler)(void));

/**
  @Summary
    Dynamic Interrupt Handler for IOCEF2 pin

  @Description
    This is a dynamic interrupt handler to be used together with the IOCEF2_SetInterruptHandler() method.
    This handler is called every time the IOCEF2 ISR is executed and allows any function to be registered at runtime.
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    None.

  @Example
    PIN_MANAGER_Initialize();
    IOCEF2_SetInterruptHandler(IOCEF2_InterruptHandler);

*/
extern void (*IOCEF2_InterruptHandler)(void);

/**
  @Summary
    Default Interrupt Handler for IOCEF2 pin

  @Description
    This is a predefined interrupt handler to be used together with the IOCEF2_SetInterruptHandler() method.
    This handler is called every time the IOCEF2 ISR is executed. 
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    None.

  @Example
    PIN_MANAGER_Initialize();
    IOCEF2_SetInterruptHandler(IOCEF2_DefaultInterruptHandler);

*/
void IOCEF2_DefaultInterruptHandler(void);



#endif // PIN_MANAGER_H
/**
 End of File
*/